[{"out":"3/30/2021, 6:00:12 PM","accomplished":"retrieve player price count using mongo and implement as a variable in getUser function. asyncronous magic...","in":"3/30/2021, 4:30:43 PM"},{"out":"3/30/2021, 8:48:12 AM","accomplished":"recorded user component debugging for youtube. got user component and equity field in account page to reflect updated player prices","in":"3/30/2021, 6:36:43 AM"},{"out":"3/28/2021, 7:22:41 PM","accomplished":"Recorded retro for youtube channel","in":"3/28/2021, 7:02:09 PM"},{"out":"3/28/2021, 5:28:45 PM","accomplished":"improved nav styling. fixed sort filter to beneath header. added recent interests component inline with sort filter","in":"3/28/2021, 1:45:53 PM"},{"out":"3/28/2021, 11:00:33 AM","accomplished":"fixed logic for populate db buttons. updated price-update script for new price object structure (not flexible yet). ran script and refreshed db. introduced duplicate position bug on account page. made some styling updates. fixed bug in timesheet","in":"3/28/2021, 8:34:19 AM"},{"out":"3/27/2021, 10:03:22 AM","accomplished":"implemented data service in a few places. added price sorting. made some login workflow improvements","in":"3/27/2021, 7:44:39 AM"},{"out":"3/26/2021, 5:46:44 PM","accomplished":"rolled back data service implementation on players. need to find out why it made an infinite loop on players but not on users. has something to to with headers comping from app component state","in":"3/26/2021, 4:45:32 PM"},{"out":"3/26/2021, 8:13:30 AM","accomplished":"added sorting input to app page. programmed player sorting into mongo. changing sort input doesn't work because of data service bugs","in":"3/26/2021, 6:45:14 AM"},{"out":"3/21/2021, 5:16:55 PM","accomplished":"added more animation. tried to figure out axios cancel token. still having infinite loop issue","in":"3/21/2021, 3:21:40 PM"},{"out":"3/21/2021, 12:01:49 PM","accomplished":"Implemented data service in index. It either loops infinitely or doesn't refresh for the search bar","in":"3/21/2021, 8:56:45 AM"},{"out":"3/20/2021, 12:09:54 PM","accomplished":"Built autocomplete dropdown. added loading animation. Started on data service","in":"3/20/2021, 6:45:27 AM"},{"out":"3/18/2021, 8:41:26 AM","accomplished":"recorded live retro, added player profile routing","in":"3/18/2021, 7:00:00 AM"},{"in":"3/17/2021, 2:10:59 PM", "out":"3/17/2021, 4:14:23 PM","accomplished":"created timesheet component"}]